/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "Tietokoneen internet-yhteys on pois päältä.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "Tietokoneen internet-yhteys on ehkä pois päältä.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "Tietokoneen internet-yhteys on päällä.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "Tietokoneen DNS-palvelin ei vastaa.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "DNS-palvelin ei löytänyt palvelimen nimeä.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "Tietokoneen reititin ei vastaa.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "Palvelin, johon tietokone yrittää muodostaa yhteyttä, ei vastaa.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "Tietokoneen internet-yhteys on päällä.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "Verkkolomakkeen salasana";

/* HTTP result code string */
"accepted" = "hyväksytty";

/* HTTP result code string */
"bad gateway" = "virheellinen yhdyskäytävä";

/* HTTP result code string */
"bad request" = "virheellinen pyyntö";

/* HTTP result code string */
"client error" = "asiakasvirhe";

/* HTTP result code string */
"conflict" = "ristiriita";

/* HTTP result code string */
"continue" = "jatka";

/* HTTP result code string */
"created" = "luotu";

/* HTTP result code string */
"expectation failed" = "odotus epäonnistui";

/* HTTP result code string */
"forbidden" = "kielletty";

/* HTTP result code string */
"found" = "löytyi";

/* HTTP result code string */
"gateway timed out" = "yhdyskäytävä aikakatkaistiin";

/* HTTP result code string */
"informational" = "tietoa antava";

/* HTTP result code string */
"internal server error" = "palvelimen sisäinen virhe";

/* HTTP result code string */
"length required" = "pituus vaaditaan";

/* HTTP result code string */
"method not allowed" = "menetelmä ei sallittu";

/* HTTP result code string */
"moved permanently" = "siirretty pysyvästi";

/* HTTP result code string */
"multiple choices" = "useita vaihtoehtoja";

/* HTTP result code string */
"needs proxy" = "tarvitsee välipalvelimen";

/* HTTP result code string */
"no content" = "ei sisältöä";

/* HTTP result code string */
"no error" = "ei virhettä";

/* HTTP result code string */
"non-authoritative information" = "varmentamaton tieto";

/* HTTP result code string */
"not found" = "ei löytynyt";

/* HTTP result code string */
"not modified" = "ei muokattu";

/* HTTP result code string */
"partial content" = "osittainen sisältö";

/* HTTP result code string */
"payment required" = "maksu vaaditaan";

/* HTTP result code string */
"precondition failed" = "ennakkoehto ei täyttynyt";

/* HTTP result code string */
"proxy authentication required" = "välipalvelimen todentaminen vaaditaan";

/* HTTP result code string */
"redirected" = "uudelleenohjattu";

/* HTTP result code string */
"no longer exists" = "ei ole enää olemassa";

/* HTTP result code string */
"request timed out" = "pyyntö aikakatkaistiin";

/* HTTP result code string */
"request too large" = "pyyntö liian suuri";

/* HTTP result code string */
"requested URL too long" = "pyydetty osoite liian pitkä";

/* HTTP result code string */
"requested range not satisfiable" = "pyydetty alue virheellinen";

/* HTTP result code string */
"reset content" = "nollaa sisältö";

/* HTTP result code string */
"see other" = "katso muu";

/* HTTP result code string */
"server error" = "palvelinvirhe";

/* HTTP result code string */
"service unavailable" = "palvelu ei käytettävissä";

/* HTTP result code string */
"success" = "onnistui";

/* HTTP result code string */
"switching protocols" = "vaihdetaan protokollia";

/* HTTP result code string */
"temporarily redirected" = "väliaikaisesti uudelleenohjattu";

/* HTTP result code string */
"unacceptable" = "ei kelpaa";

/* HTTP result code string */
"unauthorized" = "ei valtuutettu";

/* HTTP result code string */
"unimplemented" = "ei toteutettu";

/* HTTP result code string */
"unsupported media type" = "ei tuettu mediatyyppi";

/* HTTP result code string */
"unsupported version" = "ei tuettu versio";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "Välipalvelimen (HTTP) kanssa viestittäessä oli ongelma.";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "Viestittäessä suojatun välipalvelimen (HTTPS) kanssa oli ongelma.";

/* WebFoundationErrorUnknown description */
"Err-998" = "tuntematon virhe";

/* WebFoundationErrorCancelled description */
"Err-999" = "kumottu";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "virheellinen osoite";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "Pyyntö aikakatkaistiin.";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "ei-tuettu osoite";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "Määriteltyä palvelinta ei löytynyt.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "Ei yhteyttä palvelimeen.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "Verkkoyhteys katkesi.";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "Nimipalveluvirhe";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "liikaa HTTP-uudelleenohjauksia";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "resurssi ei käytettävissä";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "Internet-yhteys on pois päältä.";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "uudelleenohjattu ei mihinkään";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "Palvelin vastasi virheellisesti.";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "nollatavuinen resurssi";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "raakadataa ei voida purkaa";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "sisältödataa ei voida purkaa";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "vastausta ei voida jäsentää";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "Kansainvälinen roaming ei käytössä.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "Datayhteyttä ei voida luoda, koska sinulla on puhelu kesken.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "Datayhteys ei ole tällä hetkellä sallittu.";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "liian monta tekstipyyntöä";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "Pyydettyä osoitetta ei löytynyt palvelimelta.";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "tiedosto on hakemisto";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "Sinulla ei ole oikeutta käyttää pyydettyä resurssia.";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "resurssi ylittää enimmäiskoon";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "Palvelimeen ei voida muodostaa suojattua yhteyttä, koska tapahtui SSL-virhe.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "Palvelimen varmenne on vanhentunut.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "Palvelimen varmenne on vanhentunut. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "Palvelimen varmenne on virheellinen.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "Palvelimen varmenne on virheellinen. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "Palvelimen varmenteen on allekirjoittanut tuntematon varmentaja.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "Palvelimen varmenteen on allekirjoittanut tuntematon varmentaja. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "Palvelimen varmenne ei ole vielä voimassa.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "Palvelimen varmenne ei ole vielä voimassa. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "Palvelin ei hyväksynyt varmennetta.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "Palvelin ”%@” ei hyväksynyt varmennetta.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "Palvelin vaatii asiakasvarmenteen.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "Palvelin ”%@” vaatii asiakasvarmenteen.";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "verkosta ei voida ladata";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "Tiedostoa ei voida luoda";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "Tiedostoa ei voida avata";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "Tiedostoa suljettaessa tapahtui virhe";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "Tiedostoa ei voida kirjoittaa";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "Tiedostoa ei voida poistaa";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "Tiedostoa ei voida siirtää";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "Ladattavan tiedoston purkaminen epäonnistui";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "Ladattavan tiedoston purkaminen epäonnistui";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "Haluatko yhdistää palvelimeen siitä huolimatta?";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "Muuta välipalvelimen asetuksia avaamalla Verkkoasetukset, osoittamalla ensin Lisävalinnat ja sitten Välipalvelimet. Apua ongelmaan saat ottamalla yhteyttä järjestelmän ylläpitäjään.";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "Välipalvelimen todentaminen vaaditaan";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "%@-välipalvelimen todentaminen\n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "Kumoa";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "Käyttäjätunnus";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "Salasana";
